# Data Cleaning Step

### Table of Contents:
* [1. Importing relevant libraries](#point_1)
* [2. Preliminary Data Analysis](#point_2)
* [3. Gathering Salary Information](#point_3)

<a id="point_1"></a>
### 1. Importing Relevant Libraries

In [1]:
"""Data Science Packages"""
import numpy as np
import pandas as pd

"""Data Visualisation Packages"""
import matplotlib.pyplot as plt
import seaborn as sns

<a id="point_2"></a>
### 2. Preliminary Data Analysis

<a id="point_3"></a>
### 3. Gathering Salary Information

In [13]:
salary_data = {'Job Title':  ['Data Scientist', 'Data Scientist', 'Data Engineer', 'Data Engineer', 'Data Analyst', 'Data Analyst', 'Quantitative Analyst', 'Technology Consultant', 'Technology Consultant'],
        'Position Level': ['Senior', 'Junior', 'Senior', 'Junior','Senior', 'Junior', 'General', 'Senior', 'Junior'],
        'Average Base Pay': [118000, 52200, 78000, 48000, 57600, 51800, 120000, 84000, 75600],
        'Number of Respondents': [4, 3, 4, 1, 12, 33, 9, 1, 9],
        'Number of Listed Jobs': [928, 568, 1051, 4334, 923, 252, 512, 821, 1902]
        }

salary_df = pd.DataFrame (salary_data, columns = ['Job Title', 'Position Level', 'Average Base Pay', 'Number of Respondents','Number of Listed Jobs'])
salary_df

,Job Title,Position Level,Average Base Pay,Number of Respondents,Number of Listed Jobs
0,Data Scientist,Senior,118000,4,928
1,Data Scientist,Junior,52200,3,568
2,Data Engineer,Senior,78000,4,1051
3,Data Engineer,Junior,48000,1,4334
4,Data Analyst,Senior,57600,12,923
5,Data Analyst,Junior,51800,33,252
6,Quantitative Analyst,General,120000,9,512
7,Technology Consultant,Senior,84000,1,821
8,Technology Consultant,Junior,75600,9,1902